package com.dji.sdk.cloudapi.control;

import com.dji.sdk.exception.CloudSDKException;
import com.fasterxml.jackson.annotation.JsonCreator;
import com.fasterxml.jackson.annotation.JsonValue;

import java.util.Arrays;

/**
 * 相机光圈枚举值
 *
 * @author Qfei
 * @date 2026/3/5 16:07
 */
public enum CameraApertureEnum {

    /**
     * {"0":"F_AUTO","50":"F0_5","70":"F0_7","80":"F0_8","90":"F0_9","95":"F0_95","100":"F1_0","110":"F1_1","120":"F1_2","140":"F1_4","160":"F1_6","170":"F1_7","180":"F1_8","200":"F2","220":"F2_2","240":"F2_4","250":"F2_5","280":"F2_8","320":"F3_2","330":"F3_3","340":"F3_4","350":"F3_5","400":"F4","440":"F4_4","450":"F4_5","480":"F4_8","500":"F5","560":"F5_6","630":"F6_3","670":"F6_7","680":"F6_8","710":"F7_1","800":"F8","900":"F9","950":"F9_5","960":"F9_6","1000":"F10","1100":"F11","1300":"F13","1400":"F14","1600":"F16","1800":"F18","1900":"F19","2000":"F20","2200":"F22","2500":"F25","2700":"F27","2900":"F29","3200":"F32","3600":"F36","3800":"F38","4000":"F40","4500":"F45","5100":"F51","5400":"F54","5700":"F57","6400":"F64","7200":"F72","7600":"F76","8000":"F80","9000":"F90","10700":"F107","12800":"F128","18000":"F180","25600":"F256"}
     */
    F_AUTO(0, "F_AUTO"),

    F0_5(50, "F0_5"),

    F0_7(70, "F0_7"),

    F0_8(80, "F0_8"),

    F0_9(90, "F0_9"),

    F0_95(95, "F0_95"),

    F1_0(100, "F1_0"),

    F1_1(110, "F1_1"),

    F1_2(120, "F1_2"),

    F1_4(140, "F1_4"),

    F1_6(160, "F1_6"),

    F1_7(170, "F1_7"),

    F1_8(180, "F1_8"),

    F2(200, "F2"),

    F2_2(220, "F2_2"),

    F2_4(240, "F2_4"),

    F2_5(250, "F2_5"),

    F2_8(280, "F2_8"),

    F3_2(320, "F3_2"),

    F3_3(330, "F3_3"),

    F3_4(340, "F3_4"),

    F3_5(350, "F3_5"),

    F4(400, "F4"),

    F4_4(440, "F4_4"),

    F4_5(450, "F4_5"),

    F4_8(480, "F4_8"),

    F5(500, "F5"),

    F5_6(560, "F5_6"),

    F6_3(630, "F6_3"),

    F6_7(670, "F6_7"),

    F6_8(680, "F6_8"),

    F7_1(710, "F7_1"),

    F8(800, "F8"),

    F9(900, "F9"),

    F9_5(950, "F9_5"),

    F9_6(960, "F9_6"),

    F10(1000, "F10"),

    F11(1100, "F11"),

    F13(1300, "F13"),

    F14(1400, "F14"),

    F16(1600, "F16"),

    F18(1800, "F18"),

    F19(1900, "F19"),

    F20(2000, "F20"),

    F22(2200, "F22"),

    F25(2500, "F25"),

    F27(2700, "F27"),

    F29(2900, "F29"),

    F32(3200, "F32"),

    F36(3600, "F36"),

    F38(3800, "F38"),

    F40(4000, "F40"),

    F45(4500, "F45"),

    F51(5100, "F51"),

    F54(5400, "F54"),

    F57(5700, "F57"),

    F64(6400, "F64"),

    F72(7200, "F72"),

    F76(7600, "F76"),

    F80(8000, "F80"),

    F90(9000, "F90"),

    F107(10700, "F107"),

    F128(12800, "F128"),

    F180(18000, "F180"),

    F256(25600, "F256")
    ;

    private final int value;

    private final String desc;

    CameraApertureEnum(int value, String desc) {
        this.value = value;
        this.desc = desc;
    }

    @JsonValue
    public int getValue() {
        return value;
    }

    public String getDesc() {
        return desc;
    }

    @JsonCreator
    public static CameraApertureEnum find(int value) {
        return Arrays.stream(values()).filter(valueEnum -> valueEnum.value == value).findAny()
                .orElseThrow(() -> new CloudSDKException(CameraApertureEnum.class, value));
    }
}
